app/controllers/api/activities_controller.rb

  def index
    @activities = Activity.all
---
SELECT "activities".* FROM "activities"

  def show
    @activity = Activity.find(params[:id])
---
SELECT  "activities".* FROM "activities" WHERE "activities"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]